W10D4/Todos/app/controllers/api/todos_controller.rb

    def show
        render json: Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def index
        render json: Todo.all
---
SELECT "todos".* FROM "todos"

    def create
        todo = Todo.new(todo_params)
        if todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Wash Car"], ["body", "Anything"], ["done", false], ["created_at", "2021-02-01 22:13:52.444938"], ["updated_at", "2021-02-01 22:13:52.444938"]]

    def update
        todo = Todo.find_by_id(params[:id])
        if todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "body" = $1, "done" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["body", "Anything"], ["done", true], ["updated_at", "2021-02-01 22:15:50.635526"], ["id", 2]]

    def destroy
        todo = Todo.find_by_id(params[:id])
        todo.delete
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 4]]