W8D1/reddit_clone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(params.require(:sub).permit(:title, :description))
    @sub.mod_id = current_user.id
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Bitcoin"], ["description", "Cryptocurrency!"], ["mod_id", 1], ["created_at", "2021-01-11 23:40:27.925602"], ["updated_at", "2021-01-11 23:40:27.925602"]]